rails/homedevise/app/controllers/users/omniauth_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "confirmed_at", "created_at", "updated_at", "provider", "uid") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def facebook
    @user = User.create_from_provider_data(request.env['omniauth.auth'])

INSERT INTO "users" ("email", "encrypted_password", "confirmed_at", "created_at", "updated_at", "provider", "uid") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def google_oauth2
    @user = User.create_from_provider_data(request.env['omniauth.auth'])